**Topic**

* Simple Pivot
  - Rearrange row to column
* Pivot Table
  - Row to Column and Apply Functions
  - Reset Index and Header
* Multiple Aggregate Function
* Pivot Table with Multiple Index
* Different Agg Function on Different Columns

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('Price2.csv')
print(df.head())

  Month  Year  Money
0   Jan  2002    615
1   Feb  2002    756
2   Mar  2002    455
3   Apr  2002    645
4   May  2002    669

# **Simple Pivot**
- Rearrange row to column

In [3]:
data = df.pivot('Month', 'Year', 'Money')
print(data)

Year   2002  2003  2004  2005
Month
Apr     645   709   178   800
Aug     217   867   515   748
Dec     179   230   121   905
Feb     756   717   879   772
Jan     615   329   896   108
Jul     157   391   429   699
Jun     913   887   422   537
Mar     455   278   934   906
May     669   995   726   324
Nov     847   536   151   195
Oct     321   950   278   173
Sep     985   459   915   437

# **Pivot Table**
- Row to Column and Apply Functions
- Reset Index and Header

In [5]:
data=pd.pivot_table(df,index=['Month'],columns='Year',values='Money',aggfunc='mean').reset_index()
print(data)

Year Month  2002  2003  2004  2005
0      Apr   645   709   178   800
1      Aug   217   867   515   748
2      Dec   179   230   121   905
3      Feb   756   717   879   772
4      Jan   615   329   896   108
5      Jul   157   391   429   699
6      Jun   913   887   422   537
7      Mar   455   278   934   906
8      May   669   995   726   324
9      Nov   847   536   151   195
10     Oct   321   950   278   173
11     Sep   985   459   915   437

### **Another Example**

In [6]:
data = ('State         AwardYear    0\n'
'Alabama        2003      89\n'
'Alabama        2004      92\n'
'Alabama        2005      108\n'
'Alabama        2006      81\n'
'Alabama        2007      71\n'
'Wyoming        2011      4\n'
'Wyoming        2012      2\n'
'Wyoming        2013      1\n'
'Wyoming        2014      4\n'
'Wyoming        2015       3\n')

from io import StringIO
df = pd.read_fwf(StringIO(data))
df

     State  AwardYear    0
0  Alabama       2003   89
1  Alabama       2004   92
2  Alabama       2005  108
3  Alabama       2006   81
4  Alabama       2007   71
5  Wyoming       2011    4
6  Wyoming       2012    2
7  Wyoming       2013    1
8  Wyoming       2014    4
9  Wyoming       2015    3

In [7]:
df2 = pd.pivot_table(df,values='0', columns='AwardYear', index=['State'])
df2

AwardYear  2003  2004   2005  2006  2007  2011  2012  2013  2014  2015
State
Alabama    89.0  92.0  108.0  81.0  71.0   NaN   NaN   NaN   NaN   NaN
Wyoming     NaN   NaN    NaN   NaN   NaN   4.0   2.0   1.0   4.0   3.0

# **Multiple Aggregate Function**

In [8]:
data_url = 'http://bit.ly/2cLzoxH'
gapminder = pd.read_csv(data_url)
print(gapminder.head(3))

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [10]:
pd.pivot_table(gapminder, values='lifeExp',
                     index=['year'],
                     columns='continent',
                     aggfunc=[min,max])

              min                           ...      max
continent  Africa Americas    Asia  Europe  ... Americas    Asia  Europe Oceania
year                                        ...
1952       30.000   37.579  28.801  43.585  ...   68.750  65.390  72.670  69.390
1957       31.570   40.696  30.332  48.079  ...   69.960  67.840  73.470  70.330
1962       32.767   43.428  31.997  52.098  ...   71.300  69.390  73.680  71.240
1967       34.113   45.032  34.020  54.336  ...   72.130  71.430  74.160  71.520
1972       35.400   46.714  36.088  57.005  ...   72.880  73.420  74.720  71.930
1977       36.788   49.923  31.220  59.507  ...   74.210  75.380  76.110  73.490
1982       38.445   51.461  39.854  61.036  ...   75.760  77.110  76.990  74.740
1987       39.906   53.636  40.822  63.108  ...   76.860  78.670  77.410  76.320
1992       23.599   55.089  41.674  66.146  ...   77.950  79.360  78.770  77.560
1997       36.087   56.671  41.763  68.835  ...   78.610  80.690  79.390  78.830
2002       39.193   58.137  42.129  70.845  ...   79.770  82.000  80.620  80.370
2007       39.613   60.916  43.828  71.777  ...   80.653  82.603  81.757  81.235

[12 rows x 10 columns]

# **Pivot Table with Multiple Index**

In [13]:
df = pd.read_csv('train.csv')
df.head()
df.drop(['PassengerId','Ticket','Name'], inplace=True, axis=1)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [15]:
table = pd.pivot_table(df,index='Sex')
table

              Age       Fare     Parch    Pclass     SibSp  Survived
Sex
female  27.915709  44.479818  0.649682  2.159236  0.694268  0.742038
male    30.726645  25.523893  0.235702  2.389948  0.429809  0.188908

In [16]:
table = pd.pivot_table(df,index=['Sex','Pclass'])
table

                     Age        Fare     Parch     SibSp  Survived
Sex    Pclass
female 1       34.611765  106.125798  0.457447  0.553191  0.968085
       2       28.722973   21.970121  0.605263  0.486842  0.921053
       3       21.750000   16.118810  0.798611  0.895833  0.500000
male   1       41.281386   67.226127  0.278689  0.311475  0.368852
       2       30.740707   19.741782  0.222222  0.342593  0.157407
       3       26.507589   12.661633  0.224784  0.498559  0.135447

# **Different Agg Function on Different Columns**

In [18]:
import numpy as np

table = pd.pivot_table(df,index=['Sex','Pclass'],aggfunc={'Age':np.mean,'Survived':np.sum})
table

                     Age  Survived
Sex    Pclass
female 1       34.611765        91
       2       28.722973        70
       3       21.750000        72
male   1       41.281386        45
       2       30.740707        17
       3       26.507589        47